import { TCategory } from '../types/categories.ts';

export const CATEGORIES: TCategory[] = [
    {
        name: 'Наука',
        events: [
            {
                year: 1953,
                body: 'Джеймс Уотсон и Фрэнсис Крик открыли структуру ДНК',
            },
            {
                year: 1969,
                body: 'Аполлон-11: первая высадка человека на Луну',
            },
            {
                year: 1990,
                body: 'Запуск телескопа «Хаббл»',
            },
            {
                year: 2003,
                body: 'Завершение проекта «Геном человека»',
            },
            {
                year: 2012,
                body: 'Открытие бозона Хиггса на Большом адронном коллайдере',
            },
        ],
    },
    {
        name: 'Технологии',
        events: [
            {
                year: 1976,
                body: 'Основание компании Apple',
            },
            {
                year: 1991,
                body: 'Представление Всемирной паутины Тимом Бернерсом-Ли',
            },
            {
                year: 2004,
                body: 'Запуск социальной сети Facebook',
            },
            {
                year: 2007,
                body: 'Представление первого iPhone',
            },
            {
                year: 2010,
                body: 'Запуск сервиса Instagram',
            },
        ],
    },
    {
        name: 'Искусство',
        events: [
            {
                year: 1889,
                body: 'Винсент Ван Гог написал картину «Звёздная ночь»',
            },
            {
                year: 1917,
                body: 'Марсель Дюшан представил «Фонтан»',
            },
            {
                year: 1937,
                body: 'Пабло Пикассо написал «Гернику»',
            },
            {
                year: 1962,
                body: 'Энди Уорхол создал «Диптих Мэрилин»',
            },
            {
                year: 1989,
                body: 'Открытие музея Гуггенхайма в Бильбао',
            },
        ],
    },
    {
        name: 'Спорт',
        events: [
            {
                year: 1936,
                body: 'Олимпийские игры в Берлине',
            },
            {
                year: 1980,
                body: 'Олимпийские игры в Москве',
            },
            {
                year: 1992,
                body: 'Олимпийские игры в Барселоне',
            },
            {
                year: 2008,
                body: 'Олимпийские игры в Пекине',
            },
            {
                year: 2016,
                body: 'Олимпийские игры в Рио-де-Жанейро',
            },
        ],
    },
    {
        name: 'Музыка',
        events: [
            {
                year: 1964,
                body: 'The Beatles выступают на шоу Эда Салливана',
            },
            {
                year: 1977,
                body: 'Выход альбома «Nevermind the Bollocks» группы Sex Pistols',
            },
            {
                year: 1982,
                body: 'Выход альбома «Thriller» Майкла Джексона',
            },
            {
                year: 1991,
                body: 'Выход альбома «Nevermind» группы Nirvana',
            },
            {
                year: 2000,
                body: 'Выход альбома «Kid A» группы Radiohead',
            },
        ],
    },
    {
        name: 'Литература',
        events: [
            {
                year: 1813,
                body: 'Публикация романа «Гордость и предубеждение» Джейн Остин',
            },
            {
                year: 1869,
                body: 'Публикация романа «Война и мир» Льва Толстого',
            },
            {
                year: 1925,
                body: 'Публикация романа «Великий Гэтсби» Фрэнсиса Скотта Фицджеральда',
            },
            {
                year: 1949,
                body: 'Публикация романа «1984» Джорджа Оруэлла',
            },
            {
                year: 1960,
                body: 'Публикация романа «Убить пересмешника» Харпер Ли',
            },
        ],
    },
];
